ToDo/app/controllers/api/steps_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 11]]
SELECT "steps".* FROM "steps" WHERE "steps"."todo_id" = $1  [["todo_id", 11]]
---
   def index # should only display the steps of the todo (based on todo's id)
    steps = Todo.find(params[:todo_id]).steps