ToDo/app/controllers/api/todos_controller.rb

  def create
  	@todo = Todo.new(todo_params)

  	if @todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hi"], ["body", "Cool"], ["done", "f"], ["created_at", "2016-11-22 18:30:55.634072"], ["updated_at", "2016-11-22 18:30:55.634072"]]

  def update
    @todo = Todo.find(params[:id])
    @todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", "t"], ["updated_at", "2016-11-22 22:49:42.191195"], ["id", 15]]